In [121]:
import pandas as pd

In [122]:
df=pd.read_csv("summer.csv")

In [123]:
df

       Year    City      Sport  ... Gender                       Event   Medal
0      1896  Athens   Aquatics  ...    Men              100M Freestyle    Gold
1      1896  Athens   Aquatics  ...    Men              100M Freestyle  Silver
2      1896  Athens   Aquatics  ...    Men  100M Freestyle For Sailors  Bronze
3      1896  Athens   Aquatics  ...    Men  100M Freestyle For Sailors    Gold
4      1896  Athens   Aquatics  ...    Men  100M Freestyle For Sailors  Silver
...     ...     ...        ...  ...    ...                         ...     ...
31160  2012  London  Wrestling  ...    Men                    Wg 84 KG  Bronze
31161  2012  London  Wrestling  ...    Men                    Wg 96 KG    Gold
31162  2012  London  Wrestling  ...    Men                    Wg 96 KG  Silver
31163  2012  London  Wrestling  ...    Men                    Wg 96 KG  Bronze
31164  2012  London  Wrestling  ...    Men                    Wg 96 KG  Bronze

[31165 rows x 9 columns]

In [124]:
df.head()

   Year    City     Sport  ... Gender                       Event   Medal
0  1896  Athens  Aquatics  ...    Men              100M Freestyle    Gold
1  1896  Athens  Aquatics  ...    Men              100M Freestyle  Silver
2  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Bronze
3  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors    Gold
4  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Silver

[5 rows x 9 columns]

1. In how many cities Summer Olympics is held so far?

In [125]:
arr=df["City"].unique()
print(arr)

['Athens' 'Paris' 'St Louis' 'London' 'Stockholm' 'Antwerp' 'Amsterdam'
 'Los Angeles' 'Berlin' 'Helsinki' 'Melbourne / Stockholm' 'Rome' 'Tokyo'
 'Mexico' 'Munich' 'Montreal' 'Moscow' 'Seoul' 'Barcelona' 'Atlanta'
 'Sydney' 'Beijing']

2. Which sport is having most number of Gold Medals so far? (Top 5)

In [126]:

medals = df[(df['Medal'] == 'Gold')]
x=[]
for s in medals['Sport'].unique():
    x.append([s,len(medals[medals['Sport']==s])])
x=pd.DataFrame(x, columns=['Sport','No of gmedals']) 
x=x.sort_values(by='No of gmedals', ascending=False)[:5]
x

         Sport  No of gmedals
0     Aquatics           1421
1    Athletics           1215
17      Rowing            890
4   Gymnastics            820
3      Fencing            552

3. Which sport is having most number of medals so far? (Top 5)

In [127]:

x=[]
for s in df['Sport'].unique():
    x.append([s,len(df[df['Sport']==s])])
x=pd.DataFrame(x, columns=['Sport','No of medals']) 
x=x.sort_values(by='No of medals', ascending=False)[:5]
x

         Sport  No of medals
0     Aquatics          4170
1    Athletics          3638
17      Rowing          2667
4   Gymnastics          2307
3      Fencing          1613

4. Which player has won most number of medals? (Top 5)

In [ ]:
#@title 
x=[]
for s in df['Athlete'].unique():
    x.append([s,len(df[df['Athlete']==s])])
x=pd.DataFrame(x, columns=['Athlete','No of medals']) 
x=x.sort_values(by='No of medals', ascending=False)[:5]
x

                    Athlete  No of medals
18640       PHELPS, Michael            22
7197       LATYNINA, Larisa            18
9948     ANDRIANOV, Nikolay            15
6591           ONO, Takashi            13
5103   MANGIAROTTI, Edoardo            13

5. Which player has won most number Gold Medals of medals?

In [128]:
#@title 

player=df[df['Medal']=='Gold']
x=[]
for s in player['Athlete'].unique():
    x.append([s,len(player[player['Athlete']==s])])
x=pd.DataFrame(x, columns=['Athlete','No of medals']) 
x=x.sort_values(by='No of medals', ascending=False)[:5]
x

               Athlete  No of medals
6851   PHELPS, Michael            18
3320       SPITZ, Mark             9
2714  LATYNINA, Larisa             9
4630       LEWIS, Carl             9
907       NURMI, Paavo             9

6. In which year India won first Gold Medal in Summer Olympics?

In [129]:
#@title 
indian=df[(df.Country=='IND') & (df.Medal=='Gold')]
indian.head(1)

      Year       City   Sport Discipline  ... Country Gender   Event Medal
5512  1928  Amsterdam  Hockey     Hockey  ...     IND    Men  Hockey  Gold

[1 rows x 9 columns]

7. Which event is most popular in terms on number of players? (Top 5)

In [130]:
#@title 
x=[]
for s in df['Event'].unique():
    x.append([s,len(df[df['Event']==s])])
x=pd.DataFrame(x, columns=['Event','No of medals']) 
x=x.sort_values(by='No of medals', ascending=False)[:5]
x

                Event  No of medals
80           Football          1497
176            Hockey          1422
138  Team Competition          1147
327        Basketball          1012
337          Handball           973

8.Which sport is having most women Gold Medalist?(top 5)

In [131]:
women=df[(df.Gender=='Women')&(df.Medal=='Gold')]
x=[]
for s in women['Sport'].unique():
    x.append([s,len(women[women['Sport']==s])])
x=pd.DataFrame(x, columns=['Sport','No of womengoldmedals']) 
x=x.sort_values(by='No of womengoldmedals', ascending=False)[:5]
x

         Sport  No of womengoldmedals
4     Aquatics                    589
7    Athletics                    389
8   Gymnastics                    268
14      Rowing                    217
11  Volleyball                    166